{
  "[PAD]": 0,
  "[UNK]": 1,
  "[CLS]": 2,
  "[SEP]": 3,
  "the": 4,
  "a": 5,
  "of": 6,
  "is": 7,
  "and": 8,
  "to": 9,
  "what": 10,
  "in": 11,
  "function": 12,
  "that": 13,
  "are": 14,
  "it": 15,
  "can": 16,
  "be": 17,
  "an": 18,
  "array": 19,
  "by": 20,
  "linked": 21,
  "for": 22,
  "data": 23,
  "with": 24,
  "how": 25,
  "from": 26,
  "at": 27,
  "you": 28,
  "main": 29,
  "or": 30,
  "element": 31,
  "node": 32,
  "elements": 33,
  "list": 34,
  "when": 35,
  "one": 36,
  "pointer": 37,
  "as": 38,
  "first": 39,
  "its": 40,
  "does": 41,
  "then": 42,
  "on": 43,
  "declared": 44,
  "they": 45,
  "will": 46,
  "into": 47,
  "between": 48,
  "which": 49,
  "variable": 50,
  "not": 51,
  "operations": 52,
  "if": 53,
  "have": 54,
  "functions": 55,
  "where": 56,
  "difference": 57,
  "stack": 58,
  "class": 59,
  "has": 60,
  "push": 61,
  "each": 62,
  "memory": 63,
  "member": 64,
  "end": 65,
  "address": 66,
  "binary": 67,
  "using": 68,
  "queue": 69,
  "tree?": 70,
  "only": 71,
  "tree": 72,
  "right": 73,
  "left": 74,
  "both": 75,
  "two": 76,
  "pop": 77,
  "list.": 78,
  "number": 79,
  "all": 80,
  "type": 81,
  "so": 82,
  "last": 83,
  "arrays": 84,
  "constant": 85,
  "lists": 86,
  "name": 87,
  "inside": 88,
  "store": 89,
  "constructor": 90,
  "compiler": 91,
  "function?": 92,
  "static": 93,
  "array.": 94,
  "string": 95,
  "search": 96,
  "variables": 97,
  "sort": 98,
  "item": 99,
  "keep": 100,
  "size": 101,
  "sorted": 102,
  "members": 103,
  "return": 104,
  "list?": 105,
  "many": 106,
  "any": 107,
  "recursive": 108,
  "implement": 109,
  "problem": 110,
  "list,": 111,
  "over": 112,
  "(or": 113,
  "case": 114,
  "location": 115,
  "find": 116,
  "enqueue": 117,
  "advantage": 118,
  "called": 119,
  "object": 120,
  "c++": 121,
  "nonconstant": 122,
  "do": 123,
  "base": 124,
  "defined": 125,
  "program": 126,
  "no": 127,
  "head": 128,
  "prototype": 129,
  "passed": 130,
  "value": 131,
  "structure": 132,
  "operation": 133,
  "used": 134,
  "add": 135,
  "code": 136,
  "points": 137,
  "smaller": 138,
  "than": 139,
  "while": 140,
  "accessed": 141,
  "array,": 142,
  "back": 143,
  "definition?": 144,
  "more": 145,
  "function.": 146,
  "but": 147,
  "insertion": 148,
  "given": 149,
  "nodes": 150,
  "circular": 151,
  "stack?": 152,
  "data,": 153,
  "top": 154,
  "through": 155,
  "added": 156,
  "local": 157,
  "until": 158,
  "strings": 159,
  "operator": 160,
  "set": 161,
  "length": 162,
  "characters": 163,
  "this": 164,
  "original": 165,
  "initialized": 166,
  "another": 167,
  "them": 168,
  "use": 169,
  "height": 170,
  "includes": 171,
  "minimum": 172,
  "null": 173,
  "contains": 174,
  "front": 175,
  "functions?": 176,
  "functions.": 177,
  "associated": 178,
  "including": 179,
  "rear": 180,
  "arguments": 181,
  "basic": 182,
  "time": 183,
  "stage": 184,
  "need": 185,
  "pointing": 186,
  "beginning": 187,
  "create": 188,
  "function,": 189,
  "root,": 190,
  "time,": 191,
  "remove": 192,
  "array?": 193,
  "sort?": 194,
  "merge": 195,
  "dequeue": 196,
  "type,": 197,
  "signature": 198,
  "queue?": 199,
  "solve": 200,
  "before": 201,
  "toward": 202,
  "pointer?": 203,
  "take": 204,
  "root": 205,
  "constructors": 206,
  "different": 207,
  "type.": 208,
  "property": 209,
  "do...while": 210,
  "selection": 211,
  "return?": 212,
  "child": 213,
  "out": 214,
  "allow": 215,
  "default": 216,
  "postfix": 217,
  "software": 218,
  "overloaded": 219,
  "would": 220,
  "memory.": 221,
  "there": 222,
  "calls": 223,
  "testing": 224,
  "running": 225,
  "element.": 226,
  "tree.": 227,
  "typically": 228,
  "included": 229,
  "types": 230,
  "based": 231,
  "definition": 232,
  "removed": 233,
  "children": 234,
  "solution": 235,
  "point": 236,
  "selects": 237,
  "idea": 238,
  "traversal": 239,
  "way": 240,
  "called.": 241,
  "elements,": 242,
  "their": 243,
  "pass": 244,
  "reference.": 245,
  "n": 246,
  "places": 247,
  "every": 248,
  "items": 249,
  "role": 250,
  "life": 251,
  "large": 252,
  "collection": 253,
  "done": 254,
  "other": 255,
  "recursion?": 256,
  "versus": 257,
  "implemented": 258,
  "describe": 259,
  "file": 260,
  "call": 261,
  "operand.": 262,
  "delete": 263,
  "place": 264,
  "right,": 265,
  "character": 266,
  "also": 267,
  "not?": 268,
  "briefly": 269,
  "program.": 270,
  "statement": 271,
  "taking": 272,
  "position,": 273,
  "order": 274,
  "outside": 275,
  "ways": 276,
  "best-case": 277,
  "objects": 278,
  "work?": 279,
  "(phase": 280,
  "variables)": 281,
  "recursion": 282,
  "involve": 283,
  "performed": 284,
  "rest": 285,
  "access": 286,
  "returns": 287,
  "least": 288,
  "data.": 289,
  "infinite": 290,
  "sentence,": 291,
  "termination": 292,
  "next": 293,
  "being": 294,
  "stores": 295,
  "must": 296,
  "arrays?": 297,
  "doubly-linked": 298,
  "traverse": 299,
  "private": 300,
  "node,": 301,
  "copy": 302,
  "already": 303,
  "stack.": 304,
  "same": 305,
  "scope": 306,
  "parent": 307,
  "once": 308,
  "divide": 309,
  "values": 310,
  "global": 311,
  "reference": 312,
  "argument": 313,
  "actual": 314,
  "position": 315,
  "current": 316,
  "loop": 317,
  "specified": 318,
  "parameters.": 319,
  "step": 320,
  "operand": 321,
  "starting": 322,
  "subtree": 323,
  "created": 324,
  "passing": 325,
  "desired": 326,
  "1": 327,
  "could": 328,
  "execute": 329,
  "stored": 330,
  "value.": 331,
  "problem.": 332,
  "sorts": 333,
  "algorithm": 334,
  "takes": 335,
  "inline": 336,
  "iteration": 337,
  "approach": 338,
  "block": 339,
  "whereas": 340,
  "class,": 341,
  "call.": 342,
  "throughout": 343,
  "time.": 344,
  "read": 345,
  "occur": 346,
  "require": 347,
  "second": 348,
  "dimensions": 349,
  "infix": 350,
  "merges": 351,
  "perform": 352,
  "solved": 353,
  "once.": 354,
  "constructor.": 355,
  "makes": 356,
  "inserts": 357,
  "side": 358,
  "new": 359,
  "body": 360,
  "making": 361,
  "calling": 362,
  "once,": 363,
  "variable.": 364,
  "directly": 365,
  "special": 366,
  "left,": 367,
  "possible": 368,
  "expressions": 369,
  "euler": 370,
  "scope.": 371,
  "initializer": 372,
  "bytes": 373,
  "iterative": 374,
  "space": 375,
  "tail": 376,
  "splits": 377,
  "programs": 378,
  "implementation": 379,
  "portions": 380,
  "anywhere": 381,
  "needs": 382,
  "except": 383,
  "children.": 384,
  "itself.": 385,
  "tree,": 386,
  "right.": 387,
  "make": 388,
  "like": 389,
  "begin": 390,
  "steps": 391,
  "coding": 392,
  "whose": 393,
  "is,": 394,
  "one.": 395,
  "index": 396,
  "those": 397,
  "parameters,": 398,
  "char[]": 399,
  "string.": 400,
  "it's": 401,
  "up": 402,
  "alternative": 403,
  "tour": 404,
  "defines": 405,
  "them.": 406,
  "allocated": 407,
  "arrays.": 408,
  "replace": 409,
  "after": 410,
  "smallest": 411,
  "less": 412,
  "causes": 413,
  "structures": 414,
  "declares": 415,
  "extra": 416,
  "first,": 417,
  "nodes,": 418,
  "iteration.": 419,
  "automatically": 420,
  "solutions": 421,
  "easier": 422,
  "cannot": 423,
  "specifying": 424,
  "product.": 425,
  "provides": 426,
  "copies": 427,
  "signature.": 428,
  "left.": 429,
  "deletion": 430,
  "subtree.": 431,
  "may": 432,
  "parameters": 433,
  "advantages": 434,
  "handle": 435,
  "defining": 436,
  "static,": 437,
  "divide-and-conquer": 438,
  "experimental": 439,
  "measuring": 440,
  "whenever": 441,
  "created,": 442,
  "unlimited": 443,
  "called,": 444,
  "infinitely.": 445,
  "declaration,": 446,
  "remaining": 447,
  "swaps": 448,
  "pointers.": 449,
  "converted": 450,
  "members.": 451,
  "stored.": 452,
  "around": 453,
  "just": 454,
  "public": 455,
  "pointers": 456,
  "stages": 457,
  "cycle": 458,
  "influenced": 459,
  "differentiated": 460,
  "multi-dimensional": 461,
  "number.": 462,
  "made.": 463,
  "initializing": 464,
  "maximum": 465,
  "public.": 466,
  "constructors.": 467,
  "combine": 468,
  "halves,": 469,
  "dynamic": 470,
  "following": 471,
  "three": 472,
  "specific": 473,
  "either": 474,
  "sizeof": 475,
  "evaluated": 476,
  "access-specifiers": 477,
  "simulate": 478,
  "prototypes.": 479,
  "incorrectly,": 480,
  "repetition;": 481,
  "followed": 482,
  "\\0": 483,
  "two,": 484,
  "measure": 485,
  "structures,": 486,
  "dequeue.": 487,
  "without": 488,
  "object-oriented": 489,
  "include?": 490,
  "variables?": 491,
  "reference?": 492,
  "compiler?": 493,
  "similarities": 494,
  "under": 495,
  "corresponding": 496,
  "paradigm.": 497,
  "abstraction": 498,
  "indicate": 499,
  "signature,": 500,
  "avoids": 501,
  "closest": 502,
  "included.": 503,
  "tests;": 504,
  "dimensions,": 505,
  "required": 506,
  "found,": 507,
  "partitioned": 508,
  "child.": 509,
  "log": 510,
  "types.": 511,
  "intialized": 512,
  "physical": 513,
  "itself": 514,
  "such": 515,
  "within": 516,
  "statement?": 517,
  "constructor?": 518,
  "class?": 519,
  "header-file?": 520,
  "characters?": 521,
  "scenario,": 522,
  "star": 523,
  "comparisons": 524,
  "created?": 525,
  "signature?": 526,
  "char[]?": 527,
  "sentence": 528,
  "influence": 529,
  "(attributes)": 530,
  "defintion.": 531,
  "explicitely.": 532,
  "provided,": 533,
  "default.": 534,
  "i.e.,": 535,
  "parameters'": 536,
  "interface,": 537,
  "live": 538,
  "program;": 539,
  "(the": 540,
  "array)": 541,
  "length.": 542,
  "expression.": 543,
  "longest": 544,
  "per": 545,
  "subproblems,": 546,
  "recursively,": 547,
  "seen": 548,
  "leftmost": 549,
  "classes": 550,
  "class.": 551,
  "solving?": 552,
  "stage?": 553,
  "programming?": 554,
  "execute?": 555,
  "variable?": 556,
  "program?": 557,
  "(&)": 558,
  "inorder": 559,
  "behaviour": 560,
  "5)": 561,
  "refinement": 562,
  "7)": 563,
  "reusability.": 564,
  "(local": 565,
  "(global": 566,
  "among": 567,
  "identifies": 568,
  "lists,": 569,
  "wrap": 570,
  "path": 571,
  "rightmost": 572,
  "subtree).": 573,
  "=": 574,
  "most": 575,
  "node.": 576,
  "scenario?": 577,
  "addressed": 578,
  "pointer/offset": 579,
  "algorithm?": 580,
  "briefly,": 581,
  "achieved": 582,
  "2)": 583,
  "alias": 584,
  "four": 585,
  "resides.": 586,
  "opposed": 587,
  "form,": 588,
  "evaluation": 589,
  "subtree,": 590,
  "forth.": 591,
  "principle.": 592,
  "walk": 593,
  "times:": 594,
  "below,": 595,
  "usually": 596,
  "always": 597,
  "condition": 598,
  "put": 599,
  "(*)": 600,
  "disadvantage": 601,
  "computers?": 602,
  "queues?": 603,
  "dereferencing": 604,
  "operator.": 605,
  "ways:": 606,
  "dynamically.": 607,
  "(as": 608,
  "last-in-first-out)": 609,
  "first-in-first-out).": 610,
  "beginning,": 611,
  "around.": 612,
  "disjoint": 613,
  "go": 614,
  "-": 615,
  "int": 616,
  "input": 617,
  "best": 618,
  "notation?": 619,
  "lists?": 620,
  "(synonym)": 621,
  "incrementing": 622,
  "traversal).": 623,
  "sets,": 624,
  "leaves.": 625,
  "entire": 626,
  "because": 627,
  "change": 628,
  "method": 629,
  "run": 630,
  "two.": 631,
  "get": 632,
  "2": 633,
  "size.": 634,
  "order.": 635,
  "leaf?": 636,
  "turn": 637,
  "tree).": 638,
  "allows": 639,
  "name,": 640,
  "inserted": 641,
  "nodes.": 642,
  "track": 643,
  "down": 644,
  "some": 645,
  "your": 646,
  "it.": 647,
  "case,": 648,
  "object.": 649,
  "include": 650,
  "fixed": 651,
  "char": 652,
  "function's": 653,
  "sorted.": 654,
  "link": 655,
  "leaf": 656,
  "individual": 657,
  "holds": 658,
  "declaration": 659,
  "single": 660,
  "header": 661,
  "together": 662,
  "children,": 663,
  "program,": 664,
  "certain": 665,
  "maintenance": 666,
  "very": 667,
  "particular": 668,
  "control": 669,
  "size,": 670,
  "divides": 671,
  "insert": 672,
  "off": 673,
  "problems": 674,
  "execution": 675,
  "having": 676,
  "declare": 677,
  "contain": 678,
  "explicitly": 679,
  "elements.": 680,
  "largest": 681,
  "puts": 682,
  "previous": 683,
  "out.": 684,
  "half": 685,
  "modify": 686,
  "correct": 687,
  "information": 688,
  "larger": 689,
  "stack,": 690,
  "levels": 691,
  "should": 692,
  ")": 693,
  "long": 694,
  "bottom": 695,
  "equal": 696,
  "move": 697,
  "unsorted": 698,
  "doubly": 699,
  "root.": 700,
  "source": 701,
  "line": 702,
  "number,": 703,
  "values.": 704,
  "want": 705,
  "accessible": 706,
  "0": 707,
  "user": 708,
  "uses": 709,
  "+": 710,
  "visit": 711,
  "during": 712,
  "process": 713,
  "been": 714,
  "specify": 715,
  "value,": 716,
  "depends": 717,
  "never": 718,
  "expression": 719,
  "initialize": 720,
  "needed.": 721,
  "in,": 722,
  "element,": 723,
  "compare": 724,
  "removes": 725,
  "onto": 726,
  "see": 727,
  "actually": 728,
  "programming": 729,
  "gives": 730,
  "works": 731,
  "these": 732,
  "random": 733,
  "assigned": 734,
  "again.": 735,
  "easily": 736,
  "functions,": 737,
  "starts": 738,
  "arguments.": 739,
  "answered": 740,
  "needed": 741,
  "able": 742,
  "case.": 743,
  "sorting": 744,
  "adding": 745,
  "greater": 746,
  "null.": 747,
  "pop.": 748,
  "whole": 749,
  "later": 750,
  "test": 751,
  "separate": 752,
  "(": 753,
  "loop.": 754,
  "definitions": 755,
  "non": 756,
  "proper": 757,
  "computer": 758,
  "again": 759,
  "reached.": 760,
  "grow": 761,
  "end.": 762,
  "zero": 763,
  "numbers": 764,
  "finds": 765,
  "o(n)": 766,
  "pointer.": 767,
  "adds": 768,
  "halves": 769,
  "small": 770,
  "part": 771,
  "refining": 772,
  "depending": 773,
  "well": 774,
  "changed": 775,
  "times": 776,
  "along": 777,
  "programmer": 778,
  "however": 779,
  "executes": 780,
  "continue": 781,
  "performs": 782,
  "piece": 783,
  "brackets": 784,
  "variables,": 785,
  "available": 786,
  "instance": 787,
  "empty": 788,
  "creates": 789,
  "itself,": 790,
  "similar": 791,
  "repeat": 792,
  "recursively": 793,
  "terminating": 794,
  "looking": 795,
  "lowest": 796,
  "split": 797,
  "traversed": 798,
  "deleting": 799,
  "finite": 800,
  "parts": 801,
  "key": 802,
  "was": 803,
  "level": 804,
  "removing": 805,
  "ability": 806,
  "determine": 807,
  "written": 808,
  "private,": 809,
  "unless": 810,
  "statements": 811,
  "memory,": 812,
  "1,": 813,
  "upon": 814,
  "own": 815,
  "public,": 816,
  "sets": 817,
  "doesn't": 818,
  "it,": 819,
  "referenced": 820,
  "parameter": 821,
  "follows": 822,
  "gets": 823,
  "instead": 824,
  "reach": 825,
  "means": 826,
  "goes": 827,
  "scenario": 828,
  "n)": 829,
  "structure.": 830,
  "arrays,": 831,
  "push,": 832,
  "fifo": 833,
  "log(n)": 834,
  "behavior": 835,
  "total": 836,
  "#name?": 837,
  "give": 838,
  "form": 839,
  "verification": 840,
  "existing": 841,
  "hold": 842,
  "faster": 843,
  "several": 844,
  "big": 845,
  "modified": 846,
  "integer": 847,
  "directly.": 848,
  "2,": 849,
  "etc.": 850,
  "variables.": 851,
  "runs": 852,
  "checks": 853,
  "class's": 854,
  "values,": 855,
  "simply": 856,
  "declaring": 857,
  "going": 858,
  "often": 859,
  "files": 860,
  "storage": 861,
  "inserting": 862,
  "incorrectly": 863,
  "writing": 864,
  "converge": 865,
  "repetition,": 866,
  "position.": 867,
  "swap": 868,
  "taken": 869,
  "till": 870,
  "item.": 871,
  "to.": 872,
  "pointers,": 873,
  "abstract": 874,
  "pop,": 875,
  "increment": 876,
  "furthest": 877,
  "conquer": 878,
  "final": 879,
  "much": 880,
  "solving": 881,
  "example": 882,
  "appropriate": 883,
  "avoid": 884,
  "simpler": 885,
  "main()": 886,
  "we": 887,
  "statement,": 888,
  "anything": 889,
  "definition.": 890,
  "declarations": 891,
  "unlike": 892,
  "keeps": 893,
  "refers": 894,
  "exists": 895,
  "don't": 896,
  "operation.": 897,
  "requires": 898,
  "placed": 899,
  "tells": 900,
  ",": 901,
  "multiple": 902,
  "cases": 903,
  "test.": 904,
  "gradually": 905,
  "dimension": 906,
  "order,": 907,
  "searches": 908,
  "repeats": 909,
  "moves": 910,
  "worst": 911,
  "sequence": 912,
  "else": 913,
  "address.": 914,
  "synonym": 915,
  "containing": 916,
  "links": 917,
  "head,": 918,
  "traverses": 919,
  "full": 920,
  "u": 921,
  "top.": 922,
  "removed.": 923,
  "popped": 924,
  "queue.": 925,
  "subtrees": 926,
  "trees": 927,
  "n's": 928,
  "visits": 929,
  "half,": 930,
  "deleted": 931,
  "phase": 932,
  "limited": 933,
  "spot": 934,
  "i.e.": 935,
  "creating": 936,
  "system": 937,
  "dividing": 938,
  "check": 939,
  "rather": 940,
  "operations.": 941,
  "problems.": 942,
  "methods": 943,
  "code,": 944,
  "smaller,": 945,
  "private.": 946,
  "select": 947,
  "still": 948,
  "method.": 949,
  "computers": 950,
  "used.": 951,
  "body.": 952,
  "true": 953,
  "executed": 954,
  "terminates": 955,
  "first.": 956,
  "lost": 957,
  "task": 958,
  "something": 959,
  "created.": 960,
  "object's": 961,
  "even": 962,
  "provided": 963,
  "one,": 964,
  "amount": 965,
  "complete": 966,
  "character.": 967,
  "interface": 968,
  "thus": 969,
  "qualifier": 970,
  "omitting": 971,
  "const": 972,
  "returned": 973,
  "non-static": 974,
  "automatic": 975,
  "3": 976,
  "shifting": 977,
  "references": 978,
  "pointer,": 979,
  "-&gt;": 980,
  "branch": 981,
  "sequential": 982,
  "head.": 983,
  "node's": 984,
  "pushed": 985,
  "now": 986,
  "leaf.": 987,
  "o(log": 988,
  "protected": 989,
  "sure": 990,
  "show": 991,
  "product": 992,
  "simulates": 993,
  "specification": 994,
  "evaluate": 995,
  "break": 996,
  "tests": 997,
  "leaving": 998,
  "general": 999,
  "production": 1000,
  "direct": 1001,
  "good": 1002,
  "code.": 1003,
  "reused": 1004,
  "reusable": 1005,
  "manipulate": 1006,
  "unique": 1007,
  "complex": 1008,
  "defined.": 1009,
  "middle": 1010,
  "for.": 1011,
  "whether": 1012,
  "run.": 1013,
  "meaning": 1014,
  "met.": 1015,
  "consists": 1016,
  "tell": 1017,
  "members,": 1018,
  "constructor,": 1019,
  "variable,": 1020,
  "}": 1021,
  "regular": 1022,
  "allocate": 1023,
  "made": 1024,
  "needed,": 1025,
  "provide": 1026,
  "leave": 1027,
  "information.": 1028,
  "shows": 1029,
  "types,": 1030,
  "result": 1031,
  "know": 1032,
  "amounts": 1033,
  "copying": 1034,
  "reaches": 1035,
  "reached": 1036,
  "repetition": 1037,
  "terminal": 1038,
  "giving": 1039,
  "(int": 1040,
  "characters.": 1041,
  "notation.": 1042,
  "compares": 1043,
  "putting": 1044,
  "pick": 1045,
  "entities": 1046,
  "on.": 1047,
  "found": 1048,
  "0,": 1049,
  "*": 1050,
  "notation": 1051,
  "initial": 1052,
  "forwards": 1053,
  "linear": 1054,
  "increase": 1055,
  "backwards": 1056,
  "list's": 1057,
  "start": 1058,
  "max": 1059,
  "temp": 1060,
  "parent's": 1061,
  "easy": 1062,
  "help": 1063,
  "portion": 1064,
  "write": 1065,
  "solution.": 1066,
  "stage.": 1067,
  "refining,": 1068,
  "production,": 1069,
  "implementing": 1070,
  "output": 1071,
  "easier.": 1072,
  "technique": 1073,
  "known": 1074,
  "allowing": 1075,
  "too": 1076,
  "problems,": 1077,
  "follow": 1078,
  "begins": 1079,
  "named": 1080,
  "computer's": 1081,
  "retrieve": 1082,
  "act": 1083,
  "3,": 1084,
  "globally": 1085,
  "evaluates": 1086,
  "contents": 1087,
  "checking": 1088,
  "loop,": 1089,
  "loops": 1090,
  "place.": 1091,
  "answer": 1092,
  "declaration.": 1093,
  "located": 1094,
  "freed": 1095,
  "initializes": 1096,
  "kind": 1097,
  "does.": 1098,
  "cant": 1099,
  "whatever": 1100,
  "dont": 1101,
  "generates": 1102,
  "limit": 1103,
  "necessary": 1104,
  "recognize": 1105,
  "knows": 1106,
  "implementations": 1107,
  "prototypes": 1108,
  "scope,": 1109,
  "come": 1110,
  "standard": 1111,
  "file.": 1112,
  "and/or": 1113,
  "need.": 1114,
  "caller's": 1115,
  "ignore": 1116,
  "overhead": 1117,
  "reference,": 1118,
  "cause": 1119,
  "recursion.": 1120,
  "self": 1121,
  "infinitely": 1122,
  "simple": 1123,
  "times,": 1124,
  "1.": 1125,
  "dynamically": 1126,
  "{": 1127,
  "characters,": 1128,
  "ends": 1129,
  "(and": 1130,
  "white": 1131,
  "space.": 1132,
  "built": 1133,
  "reads": 1134,
  "pointed": 1135,
  "predetermined": 1136,
  "destroyed": 1137,
  "comes": 1138,
  "addresses": 1139,
  "behind": 1140,
  "respect": 1141,
  "comparing": 1142,
  "end,": 1143,
  "n-1": 1144,
  "&": 1145,
  "bptr": 1146,
  "fields": 1147,
  "chain": 1148,
  "series": 1149,
  "thing": 1150,
  "otherwise": 1151,
  "direction": 1152,
  "traversing": 1153,
  "successor": 1154,
  "singly": 1155,
  "difficult": 1156,
  "storing": 1157,
  "principle": 1158,
  "recently": 1159,
  "ordered": 1160,
  "convert": 1161,
  "operands": 1162,
  "queue,": 1163,
  "problem,": 1164,
  "subsets": 1165,
  "generations": 1166,
  "according": 1167,
  "child,": 1168,
  "breaks": 1169,
  "merging": 1170,
  "leaf,": 1171,
  "possibly": 1172,
  "generate": 1173,
  "expand": 1174,
  "upon.": 1175,
  "requirements": 1176,
  "lead": 1177,
  "transition": 1178,
  "debugging": 1179,
  "work": 1180,
  "etc": 1181,
  "fails": 1182,
  "objects.": 1183,
  "properties": 1184,
  "classes.": 1185,
  "modules": 1186,
  "also,": 1187,
  "breaking": 1188,
  "remain": 1189,
  "previously": 1190,
  "example:": 1191,
  "name.": 1192,
  "4,": 1193,
  "identifier": 1194,
  "i": 1195,
  "ever": 1196,
  "almost": 1197,
  "for,": 1198,
  "while,": 1199,
  "variable's": 1200,
  "times.": 1201,
  "condition.": 1202,
  "\"": 1203,
  "atleast": 1204,
  "however,": 1205,
  "statement.": 1206,
  "specifiers": 1207,
  "keyword": 1208,
  "declared.": 1209,
  "terminates.": 1210,
  "exist": 1211,
  "instances": 1212,
  "task.": 1213,
  "everything": 1214,
  "nothing": 1215,
  "define": 1216,
  "additional": 1217,
  "names": 1218,
  "capable": 1219,
  "names,": 1220,
  "specifies": 1221,
  "can't": 1222,
  "about": 1223,
  "library": 1224,
  "elsewhere": 1225,
  "in.": 1226,
  "throught": 1227,
  "b": 1228,
  "expands": 1229,
  "replaces": 1230,
  "longer": 1231,
  "enough": 1232,
  "efficient": 1233,
  "simplest": 1234,
  "designed": 1235,
  "eventually": 1236,
  "test,": 1237,
  "become": 1238,
  "over.": 1239,
  "iteratively": 1240,
  "]": 1241,
  "string,": 1242,
  "basically": 1243,
  "array's": 1244,
  "letters": 1245,
  "parts,": 1246,
  "were": 1247,
  "twice": 1248,
  "reset": 1249,
  "duration": 1250,
  "subsequent": 1251,
  "required.": 1252,
  "dimensional": 1253,
  "sorted,": 1254,
  "k": 1255,
  "pivot": 1256,
  "moving": 1257,
  "comparison": 1258,
  "away": 1259,
  "insertions": 1260,
  "sort,": 1261,
  "(n)": 1262,
  "iterate": 1263,
  "items.": 1264,
  "(right": 1265,
  "essentially": 1266,
  "normal": 1267,
  "location.": 1268,
  "bytes.": 1269,
  "nonconst": 1270,
  "non-constant": 1271,
  "replacing": 1272,
  "together.": 1273,
  "successor.": 1274,
  "fundamental": 1275,
  "backwards.": 1276,
  "removal": 1277,
  "little": 1278,
  "increased": 1279,
  "out,": 1280,
  "compared": 1281,
  "null,": 1282,
  "double": 1283,
  "double-linked": 1284,
  "bit": 1285,
  "adt": 1286,
  "pre-defined": 1287,
  "decrement": 1288,
  "0.": 1289,
  "popping": 1290,
  "becomes": 1291,
  "parentheses": 1292,
  "equivalent": 1293,
  "(first": 1294,
  "out)": 1295,
  "enqueue,": 1296,
  "corresponds": 1297,
  "specially": 1298,
  "designated": 1299,
  "visiting": 1300,
  "visited": 1301,
  "h": 1302,
  "gradebook": 1303,
  "&lt;variable": 1304,
  "terminate": 1305,
  "algorithm.": 1306,
  "error": 1307,
  "users": 1308,
  "errors": 1309,
  "improve": 1310,
  "employed": 1311,
  "concept": 1312,
  "ease": 1313,
  "organized": 1314,
  "errors.": 1315,
  "elaboration,": 1316,
  "construction,": 1317,
  "coding.": 1318,
  "maintenance.": 1319,
  "setting": 1320,
  "1-": 1321,
  "2-": 1322,
  "well.": 1323,
  "components": 1324,
  "reuse": 1325,
  "job": 1326,
  "inheritance": 1327,
  "eliminates": 1328,
  "module": 1329,
  "inner": 1330,
  "details": 1331,
  "works.": 1332,
  "reused,": 1333,
  "encapsulation": 1334,
  "looks": 1335,
  "save": 1336,
  "lot": 1337,
  "obj": 1338,
  "main().": 1339,
  "excute": 1340,
  "{}": 1341,
  "letter": 1342,
  "assume": 1343,
  "subject": 1344,
  "programs.": 1345,
  "hold:": 1346,
  "5,": 1347,
  "retrieved": 1348,
  "practice": 1349,
  "they're": 1350,
  "use.": 1351,
  "statements,": 1352,
  "anywhere.": 1353,
  "line.": 1354,
  "it\u2019s": 1355,
  "lines": 1356,
  "so.": 1357,
  "true.": 1358,
  "conditional": 1359,
  "execute.": 1360,
  "decides": 1361,
  "passes": 1362,
  "enter": 1363,
  "said": 1364,
  "definitions.": 1365,
  "represent": 1366,
  "lost.": 1367,
  "normally": 1368,
  "term": 1369,
  "operate": 1370,
  "terminates,": 1371,
  "object,": 1372,
  "date": 1373,
  "tasks.": 1374,
  "actions": 1375,
  "against": 1376,
  "constructed": 1377,
  "passed.": 1378,
  "specifically": 1379,
  "want,": 1380,
  "main(": 1381,
  ").": 1382,
  "say": 1383,
  "question": 1384,
  "revealing": 1385,
  ".h": 1386,
  "describes": 1387,
  "receive": 1388,
  "determines": 1389,
  "do.": 1390,
  "work.": 1391,
  "above": 1392,
  "that.": 1393,
  "various": 1394,
  "files.": 1395,
  "elsewhere.": 1396,
  "content": 1397,
  "hard": 1398,
  "arguments,": 1399,
  "signatures.": 1400,
  "placing": 1401,
  "retain": 1402,
  "retains": 1403,
  "call,": 1404,
  "happens": 1405,
  "ignores": 1406,
  "performance": 1407,
  "eliminate": 1408,
  "pass-by-value": 1409,
  "objects,": 1410,
  "changes": 1411,
  "sent": 1412,
  "list)": 1413,
  "words": 1414,
  "happen": 1415,
  "recursion,": 1416,
  "progress": 1417,
  "met": 1418,
  "repetition.": 1419,
  "exit": 1420,
  "termination,": 1421,
  "successively": 1422,
  "iterates": 1423,
  "integers": 1424,
  "[": 1425,
  "dynamically,": 1426,
  "them,": 1427,
  "initialized.": 1428,
  "(i.e.": 1429,
  "has.": 1430,
  "accessed.": 1431,
  "ensure": 1432,
  "length,": 1433,
  "virtually": 1434,
  "manipulated.": 1435,
  "therefore": 1436,
  "holding": 1437,
  "send": 1438,
  "jingle": 1439,
  "void": 1440,
  "1st": 1441,
  "changed.": 1442,
  "runtime.": 1443,
  "naming": 1444,
  "later.": 1445,
  "reinitialize": 1446,
  "dimension.": 1447,
  "specified.": 1448,
  "2nd": 1449,
  "input.": 1450,
  "entry": 1451,
  "forward": 1452,
  "point.": 1453,
  "marker": 1454,
  "progresses": 1455,
  "moved": 1456,
  "front,": 1457,
  "proceeds": 1458,
  "highest": 1459,
  "o": 1460,
  "equals": 1461,
  "easiest": 1462,
  "is.": 1463,
  "sort.": 1464,
  "o(nlog(n))": 1465,
  "temp,": 1466,
  "attached": 1467,
  "points.": 1468,
  "dereferenced": 1469,
  "offset": 1470,
  "*(": 1471,
  "3)": 1472,
  "*(array": 1473,
  "element)": 1474,
  "3.": 1475,
  "pass-by-reference": 1476,
  "4.": 1477,
  "delete,": 1478,
  "arbitrary": 1479,
  "(\"links\")": 1480,
  "forms": 1481,
  "predetermine": 1482,
  "shrink": 1483,
  "fixed,": 1484,
  "traversal.": 1485,
  "access.": 1486,
  "singly-linked": 1487,
  "direction.": 1488,
  "argument.": 1489,
  "useful": 1490,
  "node;": 1491,
  "elementary": 1492,
  "predecessor": 1493,
  "primary": 1494,
  "requiring": 1495,
  "update": 1496,
  "first-out": 1497,
  "out\"": 1498,
  "container": 1499,
  "lifo": 1500,
  "off.": 1501,
  "popped.": 1502,
  "n.": 1503,
  "entered": 1504,
  "pushing": 1505,
  "keeping": 1506,
  "items,": 1507,
  "computer.": 1508,
  "operands.": 1509,
  "prefix": 1510,
  "notation,": 1511,
  "peek": 1512,
  "found.": 1513,
  "item,": 1514,
  "style": 1515,
  "isempty,": 1516,
  "front.": 1517,
  "\"first": 1518,
  "tail.": 1519,
  "back.": 1520,
  "shift": 1521,
  "back,": 1522,
  "queues": 1523,
  "arranged": 1524,
  "farthest": 1525,
  "depth": 1526,
  "inverted": 1527,
  "degree": 1528,
  "recursively.": 1529,
  "rule": 1530,
  "parent,": 1531,
  "organization": 1532,
  "(if": 1533,
  "far": 1534,
  "postorder": 1535,
  "accepted": 1536,
  ".": 1537,
  "classname": 1538,
  "solves": 1539,
  "word": 1540,
  "paradigm": 1541,
  "n/2": 1542,
  "sublists": 1543,
  "switches": 1544,
  "travel": 1545,
  "parents": 1546,
  "node(s).": 1547,
  "risk": 1548,
  "project.": 1549,
  "checking.": 1550,
  "stimulates": 1551,
  "temporary": 1552,
  "refined": 1553,
  "solving.": 1554,
  "let": 1555,
  "feedback": 1556,
  "sometimes": 1557,
  "early": 1558,
  "understanding": 1559,
  "programing.": 1560,
  "supposed": 1561,
  "pattern": 1562,
  "book": 1563,
  "bank,": 1564,
  "design": 1565,
  "affected": 1566,
  "elaboration": 1567,
  "phase-": 1568,
  "development": 1569,
  "requirements,": 1570,
  "construction": 1571,
  "system.": 1572,
  "deployment": 1573,
  "solution,": 1574,
  "phase,": 1575,
  "phase.": 1576,
  "step,": 1577,
  "version": 1578,
  "occurs": 1579,
  "prevent": 1580,
  "lack": 1581,
  "design,": 1582,
  "outcome.": 1583,
  "analysis": 1584,
  "stage,": 1585,
  "affect": 1586,
  "completely": 1587,
  "debug": 1588,
  "debug.": 1589,
  "polymorphism.": 1590,
  "fail": 1591,
  "redundant": 1592,
  "oop": 1593,
  "us": 1594,
  "principles": 1595,
  "inheritance-": 1596,
  "inherit": 1597,
  "polymorphism-": 1598,
  "manipulated": 1599,
  "manageable": 1600,
  "hide": 1601,
  "earlier": 1602,
  "finally": 1603,
  "solutions,": 1604,
  "working": 1605,
  "shared": 1606,
  "repeated": 1607,
  "encounter": 1608,
  "polymorphism": 1609,
  "understand": 1610,
  "abstraction,": 1611,
  "subclass": 1612,
  "super": 1613,
  "clock": 1614,
  "execution.": 1615,
  "uniquely": 1616,
  "programmer.": 1617,
  "mathematical": 1618,
  "symbol": 1619,
  "representing": 1620,
  "changing": 1621,
  "c,": 1622,
  "words,": 1623,
  "say,": 1624,
  "method,": 1625,
  "locally": 1626,
  "(but": 1627,
  "anywhere,": 1628,
  "statements.": 1629,
  "top,": 1630,
  "methods.": 1631,
  "appear": 1632,
  "contained": 1633,
  "hand": 1634,
  "satisfied.": 1635,
  "met,": 1636,
  "command": 1637,
  "necessarily": 1638,
  "regardless": 1639,
  "conditions.": 1640,
  "do-while": 1641,
  "(it": 1642,
  "matter": 1643,
  "construct": 1644,
  "set,": 1645,
  "attributes": 1646,
  "protected.": 1647,
  "belong": 1648,
  "since": 1649,
  "defined,": 1650,
  "specifiers.": 1651,
  "area": 1652,
  "structure,": 1653,
  "ends.": 1654,
  "bodies": 1655,
  "describing": 1656,
  "instantiated": 1657,
  "exits": 1658,
  "not.": 1659,
  "member.": 1660,
  "static.": 1661,
  "nearly": 1662,
  "whichever": 1663,
  "files,": 1664,
  "maybe": 1665,
  "user.": 1666,
  "can.": 1667,
  "implicitly": 1668,
  "calculations": 1669,
  "statically": 1670,
  "compilation": 1671,
  "provided.": 1672,
  "c++,": 1673,
  "theoretically": 1674,
  "different.": 1675,
  "he/she": 1676,
  "answers": 1677,
  "prototype,": 1678,
  "#includes": 1679,
  "entity": 1680,
  "returned.": 1681,
  "that,": 1682,
  "implementation.": 1683,
  "paramaters.": 1684,
  "providing": 1685,
  "workings": 1686,
  "hiding": 1687,
  ".cpp": 1688,
  "classes,": 1689,
  "separation": 1690,
  "components.": 1691,
  "hat": 1692,
  "pulling": 1693,
  "fairly": 1694,
  "traverse.": 1695,
  "brief": 1696,
  "description": 1697,
  "each.": 1698,
  "paramaters,": 1699,
  "signatures": 1700,
  "allowed": 1701,
  "global,": 1702,
  "programm": 1703,
  "anytime": 1704,
  "inline-expands": 1705,
  "stream": 1706,
  "(conceptually": 1707,
  "#define": 1708,
  "macro).": 1709,
  "can,": 1710,
  "zillion": 1711,
  "things,": 1712,
  "performance,": 1713,
  "optimizer": 1714,
  "procedurally": 1715,
  "integrate": 1716,
  "\u2014": 1717,
  "optimize": 1718,
  "caller.": 1719,
  "quickly": 1720,
  "easily.": 1721,
  "longer,": 1722,
  "treated": 1723,
  "unit": 1724,
  "resulting": 1725,
  "referenced.": 1726,
  "complier": 1727,
  "calls,": 1728,
  "replaced": 1729,
  "better": 1730,
  "limits": 1731,
  "caller\u2019s": 1732,
  "waste": 1733,
  "typical": 1734,
  "modifying": 1735,
  "faster,": 1736,
  "saves": 1737,
  "dummy": 1738,
  "type-safe": 1739,
  "ensures": 1740,
  "initilized": 1741,
  "char,": 1742,
  "overloading": 1743,
  "context": 1744,
  "omitted": 1745,
  "reduce": 1746,
  "diminish": 1747,
  "step.": 1748,
  "forever.": 1749,
  "coded": 1750,
  "at.": 1751,
  "'base": 1752,
  "case'": 1753,
  "forever": 1754,
  "counter": 1755,
  "simplify": 1756,
  "termination.": 1757,
  "algorithms": 1758,
  "limit.": 1759,
  "poorly,": 1760,
  "up,": 1761,
  "bases": 1762,
  "terminate,": 1763,
  "statement;": 1764,
  "ending": 1765,
  "test;": 1766,
  "clause": 1767,
  "inputing": 1768,
  "specifacations": 1769,
  "2.": 1770,
  "array[]": 1771,
  "[]": 1772,
  "a[]": 1773,
  "start,": 1774,
  "namely": 1775,
  "implicitly,": 1776,
  "a[10]": 1777,
  "assigning": 1778,
  "represented": 1779,
  "s;": 1780,
  "chars": 1781,
  "character,": 1782,
  "limited.": 1783,
  "subscript": 1784,
  "changed,": 1785,
  "spaces": 1786,
  "doesnt": 1787,
  "have.": 1788,
  "datatype": 1789,
  "arrarys": 1790,
  "ex.": 1791,
  "sends": 1792,
  "otherwise,": 1793,
  "brackets.": 1794,
  "encountered.": 1795,
  "c++.": 1796,
  "w/o": 1797,
  "initialized,": 1798,
  "else.": 1799,
  "dimensions.": 1800,
  "least.": 1801,
  "skip": 1802,
  "specified,": 1803,
  "(in": 1804,
  "4": 1805,
  "index,": 1806,
  "switch": 1807,
  "across": 1808,
  "spot.": 1809,
  "relative": 1810,
  "choose": 1811,
  "positions": 1812,
  "third": 1813,
  "swapping": 1814,
  "slot": 1815,
  "advance": 1816,
  "leftover": 1817,
  "highest)": 1818,
  "last,": 1819,
  "remainder": 1820,
  "reverse.": 1821,
  "that's": 1822,
  "scan": 1823,
  "n-1.": 1824,
  "\"x\"": 1825,
  "n,": 1826,
  "o(n^2)": 1827,
  "considered": 1828,
  "look": 1829,
  "o(n": 1830,
  "merged": 1831,
  "left)": 1832,
  "/": 1833,
  "m_sort(numbers,": 1834,
  "mid+1,": 1835,
  "right);": 1836,
  "to)": 1837,
  "held": 1838,
  "precedes.": 1839,
  "operand,": 1840,
  "unary": 1841,
  "b[": 1842,
  "instead.": 1843,
  "xptr": 1844,
  "referring": 1845,
  "plus": 1846,
  "compilation.": 1847,
  "function(int": 1848,
  "operators": 1849,
  "structs": 1850,
  "records": 1851,
  "structures.": 1852,
  "self-referential": 1853,
  "connected": 1854,
  "be.": 1855,
  "fixed.": 1856,
  "pointer-based": 1857,
  "principal": 1858,
  "permit": 1859,
  "deletions": 1860,
  "shifting,": 1861,
  "indefinite": 1862,
  "resizeable": 1863,
  "restricted": 1864,
  "possible.": 1865,
  "adjacent": 1866,
  "hand,": 1867,
  "access,": 1868,
  "fact,": 1869,
  "complexity": 1870,
  "overheads": 1871,
  "circle.": 1872,
  "directions": 1873,
  "establish": 1874,
  "directions.": 1875,
  "backward": 1876,
  "movement": 1877,
  "(more": 1878,
  "operations).": 1879,
  "mechanics": 1880,
  "complicated.": 1881,
  "involved": 1882,
  "room": 1883,
  "connections": 1884,
  "expensive": 1885,
  "storage.": 1886,
  "slightly": 1887,
  "(lifo).": 1888,
  "ad": 1889,
  "lifo.": 1890,
  "stacks": 1891,
  "operates": 1892,
  "basis": 1893,
  "stack)": 1894,
  "priority": 1895,
  "item)": 1896,
  "(remove": 1897,
  "pull": 1898,
  "below.": 1899,
  "grow.": 1900,
  "pushed,": 1901,
  "up.": 1902,
  "efficiency": 1903,
  "pushed.": 1904,
  "allocating": 1905,
  "incremented.": 1906,
  "displaying": 1907,
  "empty.": 1908,
  "thus,": 1909,
  "post": 1910,
  "fix": 1911,
  "expressions,": 1912,
  "expression,": 1913,
  "again...": 1914,
  "entered,": 1915,
  "pushes": 1916,
  "arithmetic": 1917,
  "\"a": 1918,
  "sum": 1919,
  "important": 1920,
  "gettop": 1921,
  "alternate": 1922,
  "!=": 1923,
  "boolean": 1924,
  "kept": 1925,
  "behavior.": 1926,
  "waiting": 1927,
  "fifo.": 1928,
  "addition": 1929,
  "enqueued": 1930,
  "dequeued": 1931,
  "principle,": 1932,
  "buffer,": 1933,
  "customers": 1934,
  "enque": 1935,
  "deque": 1936,
  "dequeue,": 1937,
  "utilizing": 1938,
  "\u201cfront\u201d": 1939,
  "que,": 1940,
  "external": 1941,
  "list...": 1942,
  "poiner": 1943,
  "remains": 1944,
  "had": 1945,
  "coming": 1946,
  "temp;": 1947,
  "hierarchy": 1948,
  "(except": 1949,
  "internal": 1950,
  "descendants,": 1951,
  "hierarchical": 1952,
  "branched": 1953,
  "organizes": 1954,
  "nonlinear,": 1955,
  "generation": 1956,
  "count": 1957,
  "greatest": 1958,
  "distance": 1959,
  "deepest": 1960,
  "height.": 1961,
  "8": 1962,
  "below": 1963,
  "branches": 1964,
  "'n'": 1965,
  "than,": 1966,
  "larger.": 1967,
  "parent.": 1968,
  "sub-tree": 1969,
  "tree)": 1970,
  "printing": 1971,
  "travels": 1972,
  "middle.": 1973,
  "left-most": 1974,
  "runtime": 1975,
  "big-o": 1976,
  "constructor(s)": 1977,
  "protected,": 1978,
  "friend.": 1979,
  "inherited": 1980,
  "shown": 1981,
  "given.": 1982,
  "objectname": 1983,
  "type&gt;": 1984,
  "repeatedly": 1985,
  "definite": 1986,
  "broken": 1987,
  "again,": 1988,
  "iteration,": 1989,
  "loops.": 1990,
  "lose": 1991,
  "edited": 1992,
  "words.": 1993,
  "conquer,": 1994,
  "quicksort.": 1995,
  "separating": 1996,
  "splitting": 1997,
  "those,": 1998,
  "continually": 1999,
  "try": 2000,
  "cases.": 2001,
  "theoretical": 2002,
  "hardware": 2003,
  "equation": 2004,
  "average": 2005,
  "most.": 2006,
  "calculate": 2007,
  "f(x)": 2008,
  "3n": 2009,
  "smallest(largest)": 2010,
  "bigger": 2011,
  "selecting": 2012,
  "greater,": 2013,
  "searching": 2014,
  "shifted,": 2015,
  "grown.": 2016,
  "first-in": 2017,
  "involves": 2018,
  "movie": 2019,
  "handled": 2020,
  "bottom,": 2021,
  "siblings,": 2022,
  "siblings": 2023,
  "sub": 2024,
  "shape.": 2025,
  "delete.": 2026,
  "to-be-deleted's": 2027,
  "avl": 2028,
  "replacement": 2029,
  "high": 2030,
  "feasible.": 2031,
  "company": 2032,
  "programmed.": 2033,
  "quick": 2034,
  "job.": 2035,
  "behaviors": 2036,
  "meaning,": 2037,
  "extensively": 2038,
  "completed": 2039,
  "clients": 2040,
  "specifications": 2041,
  "project": 2042,
  "estimations": 2043,
  "finalized": 2044,
  "major": 2045,
  "issues": 2046,
  "creation": 2047,
  "account": 2048,
  "bugs": 2049,
  "prove": 2050,
  "tangible.": 2051,
  "simulating": 2052,
  "lay": 2053,
  "basics": 2054,
  "groundwork": 2055,
  "further": 2056,
  "enhance": 2057,
  "solvin.": 2058,
  "illustrate": 2059,
  "serves": 2060,
  "proof": 2061,
  "verify": 2062,
  "client": 2063,
  "application.": 2064,
  "finer": 2065,
  "details.": 2066,
  "development.": 2067,
  "do/look": 2068,
  "like.": 2069,
  "meet": 2070,
  "intense": 2071,
  "begins.": 2072,
  "collect": 2073,
  "discussion": 2074,
  "arise": 2075,
  "do,": 2076,
  "effort": 2077,
  "enables": 2078,
  "developing": 2079,
  "effective": 2080,
  "minimal": 2081,
  "strategic": 2082,
  "gave": 2083,
  "costumer": 2084,
  "withdrawing": 2085,
  "money": 2086,
  "pseudo": 2087,
  "ooa/design": 2088,
  "lvl": 2089,
  "proceeding": 2090,
  "reveals": 2091,
  "design.": 2092,
  "unworkable": 2093,
  "originally": 2094,
  "estimated.": 2095,
  "affects": 2096,
  "rewrite": 2097,
  "effected": 2098,
  "verification,": 2099,
  "coding,": 2100,
  "rup": 2101,
  "is:": 2102,
  "progject": 2103,
  "vision,": 2104,
  "devilopment": 2105,
  "core": 2106,
  "system,": 2107,
  "accurate": 2108,
  "cost": 2109,
  "estimates.": 2110,
  "phase-testing": 2111,
  "refining.": 2112,
  "finalization": 2113,
  "revision.": 2114,
  "directly:": 2115,
  "indirectly:": 2116,
  "cycle.": 2117,
  "testing,": 2118,
  "done,": 2119,
  "spread": 2120,
  "showing": 2121,
  "due": 2122,
  "foresight.": 2123,
  "transition.": 2124,
  "requirements.": 2125,
  "fails,": 2126,
  "implementation,": 2127,
  "logical": 2128,
  "errors,": 2129,
  "valid": 2130,
  "3-": 2131,
  "4-": 2132,
  "5-": 2133,
  "6-": 2134,
  "7-": 2135,
  "8-": 2136,
  "9-": 2137,
  "cycle;": 2138,
  "analysis,": 2139,
  "tested": 2140,
  "identified": 2141,
  "modularability,": 2142,
  "goals": 2143,
  "security": 2144,
  "purposes": 2145,
  "someone": 2146,
  "flexible,": 2147,
  "safe": 2148,
  "module.": 2149,
  "programmers.": 2150,
  "million": 2151,
  "build": 2152,
  "are:": 2153,
  "encapsulation-": 2154,
  "accomplish.": 2155,
  "oriented": 2156,
  "programmers": 2157,
  "affecting": 2158,
  "attrubutes": 2159,
  "components,": 2160,
  "extensibility,": 2161,
  "maintainability,": 2162,
  "reduces": 2163,
  "encapsulation-objects": 2164,
  "re-usability": 2165,
  "encapsulation.": 2166,
  "inheritance.": 2167,
  "concept,the": 2168,
  "modular,": 2169,
  "view": 2170,
  "easier,": 2171,
  "identify.": 2172,
  "post-programming": 2173,
  "hassle.": 2174,
  "art": 2175,
  "reusable,": 2176,
  "implemented.": 2177,
  "mention": 2178,
  "observer.": 2179,
  "control...": 2180,
  "isolate": 2181,
  "tampering": 2182,
  "knowing": 2183,
  "cuts": 2184,
  "redundancy": 2185,
  "reusing": 2186,
  "situation.": 2187,
  "adapt": 2188,
  "feused,": 2189,
  "maintenance,": 2190,
  "re-usability.": 2191,
  "verifications": 2192,
  "hidden.": 2193,
  "manageable.": 2194,
  "info": 2195,
  "inherits": 2196,
  "alarm": 2197,
  "\u2018int": 2198,
  "()\u2019": 2199,
  "funcion": 2200,
  "main.": 2201,
  "function..?": 2202,
  "\"main()\"": 2203,
  "loading": 2204,
  "libraries,": 2205,
  "beging": 2206,
  "\"main\"": 2207,
  "programming,": 2208,
  "finished.": 2209,
  "numerical": 2210,
  "sybol": 2211,
  "value/number.": 2212,
  "'a_used_number'": 2213,
  "stand": 2214,
  "refer": 2215,
  "value/word": 2216,
  "perspective,": 2217,
  "recall": 2218,
  "stands": 2219,
  "placeholder": 2220,
  "program...": 2221,
  "68,": 2222,
  "72,": 2223,
  "256,": 2224,
  "float": 2225,
  "1.54,": 2226,
  "55.55,": 2227,
  "1.24,": 2228,
  "5.657,": 2229,
  "8.8123,": 2230,
  "et.": 2231,
  "a,": 2232,
  "b,": 2233,
  "d,": 2234,
  "e,": 2235,
  "f,": 2236,
  "!,": 2237,
  "6,": 2238,
  "p,": 2239,
  "numbers,": 2240,
  "letters,": 2241,
  "bind": 2242,
  "location;": 2243,
  "used,": 2244,
  "label": 2245,
  "food.": 2246,
  "generally": 2247,
  "globally.": 2248,
  "programing": 2249,
  "main(),": 2250,
  "it)...": 2251,
  "scoped": 2252,
  "within,": 2253,
  "it).": 2254,
  "(including": 2255,
  "statements)": 2256,
  "(unless": 2257,
  "variable).": 2258,
  "starts.": 2259,
  "if,": 2260,
  "namespaces,": 2261,
  "headers,": 2262,
  "attempted": 2263,
  "(their": 2264,
  "scope)": 2265,
  "obviously": 2266,
  "doesn\u2019t": 2267,
  "seeing": 2268,
  "\"the": 2269,
  "\u201cdo\u201d": 2270,
  "\u201cdo": 2271,
  "while\u201d": 2272,
  "differance": 2273,
  "possibility": 2274,
  "...": 2275,
  "evaluating": 2276,
  "cycles": 2277,
  "false": 2278,
  "with,": 2279,
  "executing.": 2280,
  "chance": 2281,
  "loop's": 2282,
  "executing": 2283,
  "cycle,": 2284,
  "ensuring": 2285,
  "...while": 2286,
  "embedded": 2287,
  "running,": 2288,
  "statement's": 2289,
  "conditions": 2290,
  "do...": 2291,
  "start.": 2292,
  "tested.": 2293,
  "do/while": 2294,
  "execute,": 2295,
  "\"do\"": 2296,
  "condition,": 2297,
  "true,": 2298,
  "excutes": 2299,
  "do..": 2300,
  "teh": 2301,
  "pre-check": 2302,
  "block)": 2303,
  "post-check": 2304,
  "executes,": 2305,
  "is)": 2306,
  "))": 2307,
  "executed,": 2308,
  "evaluated,": 2309,
  "proven": 2310,
  "false.": 2311,
  "executed.": 2312,
  "get,": 2313,
  "displaymessge": 2314,
  "messages": 2315,
  "reveal": 2316,
  "implementations.": 2317,
  "subclass.": 2318,
  "telling": 2319,
  "declarations,": 2320,
  "optionally": 2321,
  "enclosed": 2322,
  "({}).": 2323,
  "class...": 2324,
  "details...": 2325,
  "belonging": 2326,
  "delineates": 2327,
  "done.": 2328,
  "section": 2329,
  "section,": 2330,
  "semicolon": 2331,
  "funtions": 2332,
  "constructors,": 2333,
  "methods,": 2334,
  "curly": 2335,
  "prenthesis,": 2336,
  "expanded": 2337,
  "functioning": 2338,
  "field": 2339,
  "avariable": 2340,
  "isdeclared": 2341,
  "attribute": 2342,
  "type...": 2343,
  "derive": 2344,
  "atributes": 2345,
  "permanent": 2346,
  "member-function": 2347,
  "definition's": 2348,
  "accessible,": 2349,
  "throughought": 2350,
  "\"local\"": 2351,
  "permanently": 2352,
  "program's": 2353,
  "temporal": 2354,
  "closing": 2355,
  "closes": 2356,
  "cannot.": 2357,
  "definition,": 2358,
  "freely.": 2359,
  "useable": 2360,
  "defination's": 2361,
  "definition\u2019s": 2362,
  "exits.": 2363,
  "encapsulated": 2364,
  "wise": 2365,
  "display": 2366,
  "text": 2367,
  "purposes,": 2368,
  "using.": 2369,
  "what.": 2370,
  "object\u2019s": 2371,
  "intialize": 2372,
  "resources,": 2373,
  "normally,": 2374,
  "(example:": 2375,
  "employee": 2376,
  "employee1(parameters)": 2377,
  "employee).": 2378,
  "w/in": 2379,
  "completes": 2380,
  "initialises": 2381,
  "varioubles": 2382,
  "modifies": 2383,
  "instantiation.": 2384,
  "instantiated,": 2385,
  "interaction": 2386,
  "either.": 2387,
  "usual": 2388,
  "computes": 2389,
  "instance,": 2390,
  "void,": 2391,
  "void.": 2392,
  "whereas,": 2393,
  "task,": 2394,
  "independent": 2395,
  "our": 2396,
  "compiles": 2397,
  "whenevery": 2398,
  "specifiy": 2399,
  "present.": 2400,
  "constructor's": 2401,
  "parameterless": 2402,
  "you,": 2403,
  "user-defined": 2404,
  "explictly": 2405,
  "consructor.": 2406,
  "stated.": 2407,
  "complier,": 2408,
  "fact": 2409,
  "overloaded.": 2410,
  "wishes": 2411,
  "instantiating": 2412,
  "overloading.": 2413,
  "overloaded,": 2414,
  "passed/returned.": 2415,
  "unlimited,": 2416,
  "wanted/needed": 2417,
  "overload": 2418,
  "wants": 2419,
  "create.": 2420,
  "parenthesis": 2421,
  "future,": 2422,
  "yet": 2423,
  "how.": 2424,
  "who,": 2425,
  "common": 2426,
  "guts": 2427,
  "brain,": 2428,
  "brain": 2429,
  "producing": 2430,
  "output.": 2431,
  "defintion": 2432,
  "thought": 2433,
  "such.": 2434,
  "(w/multiple": 2435,
  "parameters)": 2436,
  "doing.": 2437,
  "paramater": 2438,
  "activity.": 2439,
  "on,": 2440,
  "etc...": 2441,
  "correct.": 2442,
  "lays": 2443,
  "expects": 2444,
  "exposing": 2445,
  "existing,": 2446,
  "framework": 2447,
  "programmed": 2448,
  "states": 2449,
  "compilation,": 2450,
  "as,": 2451,
  "process,": 2452,
  "functgion": 2453,
  "output,": 2454,
  "implementations,": 2455,
  "reviling": 2456,
  "share": 2457,
  "\"reusable\"": 2458,
  "convention": 2459,
  "filename": 2460,
  "extension.": 2461,
  "differs": 2462,
  "\"source-code.\"": 2463,
  "library.": 2464,
  "constants.": 2465,
  "\u201cinstruct\u201d": 2466,
  "user-written": 2467,
  "comon": 2468,
  "#include": 2469,
  "\"hat.h\"": 2470,
  "container,": 2471,
  "hat.": 2472,
  "retrieval": 2473,
  "contents,": 2474,
  "mainly": 2475,
  "put(),": 2476,
  "peek(),": 2477,
  "pull().": 2478,
  "source-code": 2479,
  "prototye": 2480,
  "cross": 2481,
  "communication": 2482,
  "lump": 2483,
  "methods/classes": 2484,
  "re": 2485,
  "usability.": 2486,
  "programer": 2487,
  "readability": 2488,
  "promote": 2489,
  "reusuablitly": 2490,
  "here": 2491,
  "library's": 2492,
  "take.": 2493,
  "prototype.": 2494,
  "miscellaneous": 2495,
  "prototyp": 2496,
  "tha": 2497,
  "identification": 2498,
  "thrown": 2499,
  "paramaters": 2500,
  "semi-colon.": 2501,
  "unqiue": 2502,
  "deceleration": 2503,
  "retrain": 2504,
  "accesed": 2505,
  "file-scope.": 2506,
  "wit": 2507,
  "level.": 2508,
  "globally,": 2509,
  "(accessible": 2510,
  "program)": 2511,
  "script.": 2512,
  "fucntions.": 2513,
  "advises": 2514,
  "calls;": 2515,
  "\"advises\"": 2516,
  "out...": 2517,
  "faster.": 2518,
  "compiles,it": 2519,
  "inplace,": 2520,
  "avoiding": 2521,
  "treats": 2522,
  "copied": 2523,
  "place,": 2524,
  "bigger.": 2525,
  "(when": 2526,
  "appropriate)": 2527,
  "invoked,": 2528,
  "overall": 2529,
  "(means": 2530,
  "faster)": 2531,
  "references,": 2532,
  "maintaining": 2533,
  "syntax": 2534,
  "reasons,": 2535,
  "alter": 2536,
  "stuff.": 2537,
  "unessesary": 2538,
  "elimitates": 2539,
  "amonts": 2540,
  "online": 2541,
  "computing": 2542,
  "wasted": 2543,
  "permission": 2544,
  "edit": 2545,
  "caller": 2546,
  "directly,": 2547,
  "overall,": 2548,
  "especially": 2549,
  "numbers.": 2550,
  "point,": 2551,
  "reducing": 2552,
  "amout": 2553,
  "improves": 2554,
  "ofdata": 2555,
  "subroutine": 2556,
  "procedure": 2557,
  "correspondence": 2558,
  "subprogram": 2559,
  "conditions/inputs": 2560,
  "distinguishes": 2561,
  "encodes": 2562,
  "linkage,": 2563,
  "distinguished": 2564,
  "signatures,": 2565,
  "mangling": 2566,
  "decoration,": 2567,
  "linkage": 2568,
  "conform": 2569,
  "tpes": 2570,
  "(int,": 2571,
  "etc.)": 2572,
  "examines": 2573,
  "candidate": 2574,
  "viable": 2575,
  "differntiated": 2576,
  "differentiates": 2577,
  "paremeters": 2578,
  "(return": 2579,
  "invovles": 2580,
  "haing": 2581,
  "overrides": 2582,
  "presence.": 2583,
  "feature": 2584,
  "terminate.": 2585,
  "badly": 2586,
  "algorithyms.": 2587,
  "converges": 2588,
  "\"indefinite\"": 2589,
  "exhausting": 2590,
  "incorrect": 2591,
  "missing": 2592,
  "(converge": 2593,
  "case).": 2594,
  "reduced": 2595,
  "successfully": 2596,
  "recurse": 2597,
  "ways,": 2598,
  "towards": 2599,
  "poorly": 2600,
  "improper": 2601,
  "handling": 2602,
  "handled.": 2603,
  "varied.": 2604,
  "building": 2605,
  "incorerectly": 2606,
  "programmar": 2607,
  "situations": 2608,
  "themselves.": 2609,
  "stopping": 2610,
  "controlled": 2611,
  "discussed": 2612,
  "earlier,": 2613,
  "actions.": 2614,
  "described": 2615,
  "relates": 2616,
  "indefinitely.": 2617,
  "iteration-repetition": 2618,
  "recursion-selection": 2619,
  "-iteration-explicitly": 2620,
  "-recursion-repeated": 2621,
  "-iteration-loop-termination": 2622,
  "-recursion-base": 2623,
  "-iteration-modifies": 2624,
  "loop-termination": 2625,
  "-recursion-produces": 2626,
  "progressively": 2627,
  "versions": 2628,
  "indefinitely": 2629,
  "-iteration-if": 2630,
  "loop-continuation": 2631,
  "-recursion-if": 2632,
  "similarities:": 2633,
  "rely": 2634,
  "(loop)": 2635,
  "entering": 2636,
  "iterativly": 2637,
  "repetative": 2638,
  "loops,": 2639,
  "omitted.": 2640,
  "slowly": 2641,
  "locks": 2642,
  "shuts": 2643,
  "halts": 2644,
  "repeating": 2645,
  "repition": 2646,
  "repitition,": 2647,
  "potentially": 2648,
  "infinetly.": 2649,
  "graduatlly": 2650,
  "correctly.": 2651,
  "cirtain": 2652,
  "(its": 2653,
  "recursion).": 2654,
  "infinitly": 2655,
  "infinately": 2656,
  "stop.": 2657,
  "repetiive": 2658,
  "recurisve": 2659,
  "guaranteeed": 2660,
  "pre-determined": 2661,
  "n[10];": 2662,
  "//array": 2663,
  "10": 2664,
